# ColumnHeading Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..ColumnHeading Property
ScheduleField Class See Also
---
The column heading text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string ColumnHeading { get; set; }
```

Visual Basic
---
```text
Public Property ColumnHeading As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ColumnHeading {
	String^ get ();
	void set (String^ value);
}
```

# ### Field Value
The heading text.
# Remarks
On initial creation of a ScheduleField, the column heading is initialized based on the field name (typically a parameter name).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace